// Ани обича да пътува и иска тази година да посети няколко различни дестинации. Като си избере дестинация, ще прецени колко пари ще й трябват, за да отиде до там и ще започне да спестява. Когато е спестила достатъчно, ще може да пътува.
// Функцията получава масив, като всеки път ще се четат първо дестинацията и минималния бюджет, който ще е нужен за пътуването. 
// След това ще се четат няколко суми, които Ани спестява като работи и когато успее да събере достатъчно за пътуването, ще заминава, като на конзолата трябва да се изпише:
//  "Going to {дестинацията}!" 
// Когато е посетила всички дестинации, които иска, вместо дестинация ще въведе "End" и програмата ще приключи.

function nametraveling(input) {
    let index = 0;
    let row = input[index];

    while (row !== "End") {
        let destination = row;
        index++;

        let budget = Number(input[index]);
        let sum = 0;

        while (sum < budget) {
            index++;
            let currMoney = Number(input[index]);

            sum += currMoney;

        }

        console.log(`Going to ${destination}!`);
        index++;
        row = input[index];
    }

}
nametraveling(["Greece",
    "1000",
    "200",
    "200",
    "300",
    "100",
    "150",
    "240",
    "Spain",
    "1200",
    "300",
    "500",
    "193",
    "423",
    "End"]);