// Да се напише програма, която  пресмята каква печалба или загуба ще реализира фирма произвеждаща AND процесори. Един процесор се изработва за 3 часа. Фирмата има даден брой служители, които работят определен брой дни. Приема се, че един служител работи 8 часа на ден. Фирмата има за цел да изработи определен брой процесори. Плануваният брой процесори, броят на служителите във фирмата и дните се прочитат от конзолата. Броят на произведените процесори да бъде закръглен към по-малкото цяло число.

// Пример: за 10 часа се изработват 10/3 = 3.33 процесора   3 процесора. Един брой струва 110.10 лв. Според количеството изработени процесори принтирайте на конзолата, колко повече или по-малко пари са изкарани от плануваното. 
// Вход:
// От конзолата се четат 3 реда:
// •	Първи ред – броят процесори, които трябва да се изработят – цяло число в интервала [1...500 000]
// •	Втори ред – броят служители – цяло число в интервала [1...1000]
// •	Трети ред – работните дни – цяло число в интервала [1...1000]
// Изход:
// На конзолата трябва да се отпечата текст, спрямо броя на изработените процесори:
// •	Ако са повече или колкото плануваните:
// o	"Profit: -> {печалби} BGN"
// •	Ако са по-малко от плануваните:
// o	"Losses: -> {загуби} BGN"
// Сумите трябва да са форматирани до втория знак след десетичната запетая.

function andProcessors(input) {
    let processorsPlan = Number(input[0]);
    let staffCount = Number(input[1]);
    let workDaysCount = Number(input[2]) * 8;

    let totalStaffTime = staffCount * workDaysCount;
    let realManif = Math.floor(totalStaffTime / 3);
    let diff = processorsPlan - realManif;

    if (realManif >= processorsPlan) {
        let profit = (realManif * 110.10) - (processorsPlan * 110.10);
        console.log(`Profit: -> ${profit.toFixed(2)} BGN`);
    } else {
        let lost = (processorsPlan * 110.10) - (realManif * 110.10);
        console.log(`Losses: -> ${lost.toFixed(2)} BGN`);
    }
}
andProcessors(["150",
    "7",
    "18"])
    ;