// Коледа наближава и Иван решава да купи по един подарък за всеки от семейството си. Той си прави списък с хората, на които иска да подари нещо. Това, какъв подарък ще купи зависи от възрастта на хората в списъка му:
// •	Всички до 16 (вкл.) години се считат за деца и ще получат играчка
// •	Всички над 16 години се считат за възрастни и ще получат коледен пуловер
// •	Цената на всяка играчка е 5 лв., а цената на един пуловер е 15 лв.
// Напишете програма, която пресмята колко души от семейството на Иван са до 16 (вкл.) години и колко са над тази възраст, също и колко пари ще струват подаръците на децата и възрастните.
// Вход:
// От конзолата се четат поредица от редове до получаване на команда "Christmas":
// •	Годините на всеки член от семейството - цяло число в интервала [1 … 130] 
// Изход:
// Да се отпечатат на конзолата четири реда:
// •	"Number of adults: {брой хора над 16 години}" 
// •	"Number of kids: {брой хора до 16 (вкл.) години}"
// •	"Money for toys: {сумата за всички играчки}"
// •	"Money for sweaters: {сума за всички пуловери}"

function christmasGifts(input) {
    let index = 0;
    let familyAge = input[index];
    // index++;

    let chiled = 0;
    let adult = 0;

    while (familyAge !== "Christmas") {
        let age = Number(familyAge);
        if (age <= 16) {
            chiled++;
        } else {
            adult++;
        }
        index++;
        familyAge = input[index];
    }
    console.log(`Number of adults: ${adult}`);
    console.log(`Number of kids: ${chiled}`);
    console.log(`Money for toys: ${chiled * 5}`);
    console.log(`Money for sweaters: ${adult * 15}`);
}
christmasGifts(["16",
    "16",
    "16",
    "16",
    "16",
    "Christmas"]);