// Григор Димитров е тенисист, чиято следваща цел е изкачването в световната ранглиста по тенис за мъже. 
// През годината Гришо участва в определен брой турнири, като за всеки турнир получава точки, които зависят от позицията, на която е завършил в турнира. Има три варианта за завършване на турнир:
// 	W - ако е победител получава 2000 точки
// 	F - ако е финалист получава 1200 точки
// 	SF - ако е полуфиналист получава 720 точки
// Напишете програма, която изчислява колко ще са точките на Григор след изиграване на всички турнири, като знаете с колко точки стартира сезона. Също изчислете колко точки средно печели от всички изиграни турнири и колко процента от турнирите е спечелил. 
// Вход
// От конзолата първо се четат два реда:
// •	Брой турнири, в които е участвал – цяло число в интервала [1…20] 
// •	Начален брой точки в ранглистата - цяло число в интервала [1...4000]
// За всеки турнир се прочита отделен ред:
// •	Достигнат етап от турнира – текст – "W", "F" или "SF"
// Отпечатват се три реда в следния формат:
// •	"Final points: {брой точки след изиграните турнири}"
// •	"Average points: {средно колко точки печели за турнир}"
// •	"{процент спечелени турнири}%"
// Средните точки да бъдат закръглени към най-близкото цяло число надолу, а процентът да се форматира до втората цифра след десетичния знак.


function tennisRanklist(input) {
    let tournaments = Number(input[0]);
    let startPoints = Number(input[1]);
    // let tournirName = input;
    let totalPoints = 0;
    let wonTournaments = 0;

    for (let i = 2; i < tournaments + 2; i++) {
        let name = input[i];
        if (name === "W") {
            totalPoints += 2000;
            wonTournaments++;
        } else if (name === "F") {
            totalPoints += 1200;
        } else if (name === "SF") {
            totalPoints += 720;
        }
    }

    console.log(`Final points: ${Math.floor(totalPoints + startPoints)}`);

    let avPoints = totalPoints / tournaments;
    console.log(`Average points: ${Math.floor(avPoints)}`);

    let percent = (wonTournaments / tournaments) * 100;
    console.log(`${percent.toFixed(2)}%`);
}
tennisRanklist(["4",
    "750",
    "SF",
    "W",
    "SF",
    "W"])
    ;